/datum/map/frontier/setup_map()
	..()
	system_name = "Зазеркалье"

/datum/map/sierra/map_info(victim)
	to_chat(victim, "<h2>Информация о карте</h2>")
	to_chat(victim, "Вы находитесь на фронтире. Если вы искали проблем, то это лучшее место, где их можно найти. Не так важно, что вас привело сюда, в край станций-призраков, погибших кораблей и заброшенных колоний.")
	to_chat(victim, "Важно лишь то, сумеете вы уйти отсюда на своих движках и своих двоих.")
	to_chat(victim, "На фронтире действуют некоторые неписанные правила:")
	to_chat(victim, "1. Кавалерия не прилетит. Фронтир - история про самостоятельное выживание, где каждый осознаёт (или вскоре осознает), что помощи ждать неоткуда, а опасность может поджидать где угодно. Все персонажи могут эскалировать конфликты и давать отпор с целью защититься/предупредить возможную угрозу в силу своих навыков.")
	to_chat(victim, "Вам доподлинно известно, что в секторе должна быть старая логистическая база, переоборудованная под 'маяк' или что-то вроде того. Возможно там безопасно.")
	to_chat(victim, "Фронтир не прощает ошибок, а помощи ждать неоткуда. Полезные ссылки:")
	to_chat(victim, "<a href='https://sierra.ss220.space/index.php/Стандартные_процедуры_ИКН_Сьерра'>Процедуры НТ</a>, <a href='https://sierra.ss220.space/index.php/Корпоративные_законы'>Регуляции НТ</a>, <a href='https://sierra.ss220.space/index.php/Коды_угрозы ИКН_Сьерра'>Коды угроз НТ</a>, <a href='https://sierra.ss220.space/index.php/Итак,_Вы_хотите_узнать_о_мире_корпораций%3F'>Список корпораций</a>.")
